<?php

/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */

/**
 * Description of LANGUAGE
 *
 * @author Алексей
 */
class TPL_LANGUAGE {

    public static $messages = array(
        0 => "Доступно только авторизированным пользователям"
        , 1 => "Логин должен быть не меньше 3 и не более 10 символов"
        , 2 => "Пароль должен быть не меньше 3 и не больше 16 символов"
        , 3 => "Неверный адрес E-Mail"
        , 4 => "Неверный логин или пароль"
        , 5 => "Реалм не найден"
        , 6 => "E-Mail адрес уже занят"
        , 7 => "Логин уже занят"
        , 8 => "Не удалось создать аккаунт"
        , 9 => 'Удачно!<script>setTimeout(function(){window.location = \'/Аккаунт/\'},1000)</script>'
        , 10 => 'Удачно!<script>setTimeout(function(){$(\'#hide\').hide()},1000)</script>'
        , 11 => "Удачно!<script>setTimeout('location.reload()',1000)</script>"
        , 12 => 'Удачно!<script>setTimeout(function(){$(\'#hide\').show()},1000)</script>'
        , 13 => "Запрос неверен"
        , 14 => "Удачно!<script>setTimeout('location.reload()',1000)</script>"
        , 15 => "Ошибка запроса"
        , 16 => "У вас нет аккаунта на этом реалме"
    );
    public static $race = array(
        1 => array('Человек', 0,'rgb(0, 82, 255)')
        , 2 => array('Орк', 1,'#603317')
        , 3 => array('Дворф', 0,'rgb(218, 195, 26)')
        , 4 => array('Ночной Эльф', 0,'rgb(59, 47, 197)')
        , 5 => array('Нежить', 1,'rgb(0, 140, 184)')
        , 6 => array('Таурен', 1,'rgb(172, 209, 211)')
        , 7 => array('Гном', 0,'purple')
        , 8 => array('Тролль', 1,'rgb(83, 122, 0)')
        , 9 => array('Гоблин', 1,'rgb(0, 168, 0)')
        , 10 => array('Эльф Крови', 1,'rgb(255, 95, 123)')
        , 11 => array('Дреней', 0,'rgb(196, 0, 188)')
        , 22 => array('Ворген', 0,'rgb(255, 0, 71)')
        , 24 => array('Пандарен', 2,'rgb(97, 128, 0)')
        , 25 => array('Пандарен', 0,'rgb(97, 128, 0)')
        , 26 => array('Пандарен', 1,'rgb(97, 128, 0)')
    );
    public static $class = array(
        1 => array('Воин', '#c69b6d')
        , 2 => array('Паладин', '#f48cba')
        , 3 => array('Охотник', '#aad372')
        , 4 => array('Разбойник', '#fff468')
        , 5 => array('Жрец', '#f0ebe0')
        , 6 => array('Рыцарь смерти', '#c41e3b')
        , 7 => array('Шаман', '#2359ff')
        , 8 => array('Маг', '#68ccef')
        , 9 => array('Чёрнокнижник', '#9382c9')
        , 10 => array('Монах', '#00ffba')
        , 11 => array('Друид', '#ff7c0a')
    );
    public static $map = array(
        0 => "Восточные королевства",
        1 => "Калимдор",
        13 => "Тестирование",
        25 => "Тест Скотта",
        30 => "Альтеракская долина",
        33 => "Крепость Темного Клыка",
        34 => "Тюрьма Штормграда",
        35 => "Тюрьма Штормграда",
        36 => "Мертвые копи",
        37 => "Кратер Азшары",
        42 => "Тест Коллина",
        43 => "Пещеры Стенаний",
        44 => "Монастырь",
        47 => "Лабиринты Иглошкурых",
        48 => "Непроглядная Пучина",
        70 => "Ульдаман",
        90 => "Гномреган",
        109 => "Затонувший храм",
        129 => "Курганы Иглошкурых",
        169 => "Изумрудный Сон",
        189 => "Монастырь Алого ордена",
        209 => "Зул&rsquo;Фаррак",
        229 => "Пик Черной горы",
        230 => "Глубины Черной горы",
        249 => "Логово Ониксии",
        269 => "Открытие Темного портала",
        289 => "Некроситет",
        309 => "Зул&rsquo;Гуруб",
        329 => "Стратхольм",
        349 => "Мародон",
        369 => "Подземный поезд",
        389 => "Огненная пропасть",
        409 => "Огненные Недра",
        429 => "Забытый Город",
        449 => "Казармы Альянса",
        450 => "Казармы Орды",
        451 => "Зона разработчика",
        469 => "Логово Крыла Тьмы",
        489 => "Ущелье Песни Войны",
        509 => "Руины Ан&rsquo;Киража",
        529 => "Низина Арати",
        530 => "Запределье",
        531 => "Храм Ан&rsquo;Киража",
        532 => "Каражан",
        533 => "Наксрамас",
        534 => "Битва за гору Хиджал",
        540 => "Цитадель Адского Пламени: Разрушенные залы",
        542 => "Цитадель Адского Пламени: Кузня Крови",
        543 => "Цитадель Адского Пламени: Бастионы",
        544 => "Логово Магтеридона",
        545 => "Кривой Клык: Паровое подземелье",
        546 => "Кривой Клык: Нижетопь",
        547 => "Кривой Клык: Узилище",
        548 => "Кривой Клык: Змеиное святилище",
        550 => "Крепость Бурь",
        552 => "Крепость Бурь: Аркатрац",
        553 => "Крепость Бурь: Ботаника",
        554 => "Крепость Бурь – Механар",
        555 => "Аукиндон: Темный лабиринт",
        556 => "Аукиндон: Сетеккские залы",
        557 => "Аукиндон: Гробницы Маны",
        558 => "Аукиндон: Аукенайские гробницы",
        559 => "Арена Награнда",
        560 => "Побег из Дарнхольда",
        562 => "Арена Острогорья",
        564 => "Черный храм",
        565 => "Логово Груула",
        566 => "Око Бури",
        568 => "Зул&rsquo;Аман",
        571 => "Нордскол",
        572 => "Руины Лордерона",
        573 => "ExteriorTest",
        574 => "Крепость Утгард",
        575 => "Вершина Утгард",
        576 => "Нексус",
        578 => "Окулус",
        580 => "Солнечный Колодец",
        582 => "Перевозка: из Рут&rsquo;терана в Аубердин",
        584 => "Перевозка: из Менетила на Терамор",
        585 => "Терраса Магистров",
        586 => "Перевозка: из Экзодара в Аубердин",
        587 => "Перевозка: Переправа Оперенной Луны",
        588 => "Перевозка: из Менетила в Аубердин",
        589 => "Перевозка: из Оргриммара в Гром&rsquo;гол",
        590 => "Перевозка: из Гром&rsquo;гола в Подгород",
        591 => "Перевозка: из Подгорода в Оргриммар",
        592 => "Перевозка: Борейская тундра",
        593 => "Перевозка: из Пиратской Бухты в Кабестан",
        594 => "Перевозка: Сестры милосердия Ревущего фьорда",
        595 => "Очищение Стратхольма",
        596 => "Перевозка: Нагльфар",
        597 => "Craig Test",
        598 => "Солнечный Колодец стабилизированный",
        599 => "Чертоги Камня",
        600 => "Крепость Драк&rsquo;Тарон",
        601 => "Азжол-Неруб",
        602 => "Чертоги Молний",
        603 => "Ульдуар",
        604 => "Гундрак",
        605 => "Development Land",
        606 => "QA and DVD",
        607 => "Берег Древних",
        608 => "Аметистовая крепость",
        609 => "Черный оплот",
        610 => "Транспорт: из Тирисфаля к Лагерю Возмездия",
        612 => "Транспорт: из Менетила к Вангарду",
        613 => "Транспорт: из Оргриммара к Крепости Песни Войны",
        614 => "Транспорт: из Штормграда к Крепости Отваги",
        615 => "Обсидиановое святилище",
        616 => "Око вечности",
        617 => "Стоки Даларана",
        618 => "Арена Доблести",
        619 => "Ан&rsquo;кахет: Старое Королевство",
        620 => "Транспорт: из Моа&rsquo;ки в Уну&rsquo;пе",
        621 => "Транспорт: из Моа&rsquo;ки в Камагуа",
        622 => "Транспорт: Молот Оргрима",
        623 => "Транспорт: Усмиритель небес",
        624 => "Склеп Аркавона",
        628 => "Остров Завоеваний",
        631 => "Цитадель Ледяной Короны",
        632 => "Кузня Душ",
        641 => "Transport: Alliance Airship BG",
        642 => "Transport: HordeAirshipBG",
        647 => "Транспорт: из Оргриммара в Громовой Утес",
        649 => "Испытание крестоносца",
        650 => "Испытание чемпиона",
        658 => "Яма Сарона",
        668 => "Залы Отражений",
        672 => "Транспорт: Усмиритель небес (рейды в Цитадели Ледяной Короны)",
        673 => "Транспорт: Молот Оргрима (рейды в Цитадели Ледяной Короны)",
        712 => "Транспорт: Усмиритель небес (подземелья Цитадели Ледяной Короны)",
        713 => "Транспорт: Молот Оргрима (подземелья Цитадели Ледяной Короны)",
        718 => "Транспорт: \"Могучий ветер\" (Цитадель Ледяной Короны, рейд)",
        723 => "Штормград",
        724 => "Рубиновое святилище"
    );

}

?>
